package och04_ex02;

import java.io.IOException;

public class WhileKeyControlEx {

	public static void main(String[] args) throws IOException {
		
		boolean run = true;
		int speed = 0;
		int keyCode = 0;
//      홈Work04  			if, switch문으로 만들기
//		선택: 1
//		keyCode->49
//      결과 	1) speed + 1
//		    2) 보여줘	[ 현재 속도=" + speed ]
//		2
//		keyCode->50
//      결과 1) speed - 1		
//	        2) 보여줘	[ 현재 속도=" + speed ]

//		3
//		keyCode->51
//      결과  run = false
//           Escape
		
		while(run) {
			if(keyCode != 13 && keyCode != 10) {
				System.out.println("-----------------------");
				System.out.println("1.증속 | 2.감속 | 3.중지");
				System.out.println("-----------------------");
				System.out.println("선택 : ");
				}
			
			keyCode = System.in.read(); // 아스키코드값으로 출력
			// System.out.println("keyCode = " + keyCode);
			
			if(keyCode == 49) {
				speed += 1;
				System.out.println("현재 속도 = " + speed);
			}
			else if (keyCode == 50) {
				speed -= 1;
				System.out.println("현재 속도 = " + speed);
			}
			else if (keyCode == 51) {
				run = false;
			}
			}
		System.out.println("PGM The End");
		}
//
//		-----------------------------
//		1.증속 | 2.감속 | 3.중지
//		-----------------------------
//		선택: 1
//		현재 속도=1
//		-----------------------------
//		1.증속 | 2.감속 | 3.중지
//		-----------------------------
//		선택: 1
//		현재 속도=2
//		-----------------------------
//		1.증속 | 2.감속 | 3.중지
//		-----------------------------
//		선택: 1
//		현재 속도=3
//		-----------------------------
//		1.증속 | 2.감속 | 3.중지
//		-----------------------------
//		선택: 1
//		현재 속도=4
//		-----------------------------
//		1.증속 | 2.감속 | 3.중지
//		-----------------------------
//		선택: 1
//		현재 속도=5
//		-----------------------------
//		1.증속 | 2.감속 | 3.중지
//		-----------------------------
//		선택: 1
//		현재 속도=6
//		-----------------------------
//		1.증속 | 2.감속 | 3.중지
//		-----------------------------
//		선택: 1
//		현재 속도=7
//		-----------------------------
//		1.증속 | 2.감속 | 3.중지
//		-----------------------------
//		선택: 1
//		현재 속도=8
//		-----------------------------
//		1.증속 | 2.감속 | 3.중지
//		-----------------------------
//		선택: 1
//		현재 속도=9
//		-----------------------------
//		1.증속 | 2.감속 | 3.중지
//		-----------------------------
//		선택: 1
//		현재 속도=10
//		-----------------------------
//		1.증속 | 2.감속 | 3.중지
//		-----------------------------
//		선택: 1
//		현재 속도=11
//		-----------------------------
//		1.증속 | 2.감속 | 3.중지
//		-----------------------------
//		선택: 1
//		현재 속도=12
//		-----------------------------
//		1.증속 | 2.감속 | 3.중지
//		-----------------------------
//		선택: 2
//		현재 속도=11
//		-----------------------------
//		1.증속 | 2.감속 | 3.중지
//		-----------------------------
//		선택: 2
//		현재 속도=10
//		-----------------------------
//		1.증속 | 2.감속 | 3.중지
//		-----------------------------
//		선택: 2
//		현재 속도=9
//		-----------------------------
//		1.증속 | 2.감속 | 3.중지
//		-----------------------------
//		선택: 3
//		PGM The End
	}

